[X2DownloadableContentInfo_AddedPartNames]

; these are examples.
; every entry consists of a
;     .*Template="TemplateName"
; and a
;     .*Name="DisplayString"
; without semicolons of course

; * can be Torso, Arms, Legs
; order is important. to not get confused, you should arrange them like this:
; failing to have one line registered (for whatever reason)
; results in ALL subsequent ones being shifted by one, so all parts after that will have the wrong name
; TL:DR it is CRUCIAL to always pair these entries
; parts that don't have entries at all, or have the .*Name Empty will get the old style "躯干 1" thing, for example

;=============================================================================================
;									Standard
;=============================================================================================

.TorsoTemplate="CNV_ZSF_Assault_Torso_Full"
.TorsoName="Z.S.F.突击 - 躯干 1"

.TorsoTemplate="LPL_ZSF_Assault_Torso_Full"
.TorsoName="Z.S.F.突击 - 躯干 1"

.TorsoTemplate="MPL_ZSF_Assault_Torso_Full"
.TorsoName="Z.S.F.突击 - 躯干 1"

.TorsoTemplate="HPL_ZSF_Assault_Torso_Full"
.TorsoName="Z.S.F.突击 - 躯干 1"

.TorsoTemplate="LPW_ZSF_Assault_Torso_Full"
.TorsoName="Z.S.F.突击 - 躯干 1"

.TorsoTemplate="MPW_ZSF_Assault_Torso_Full"
.TorsoName="Z.S.F.突击 - 躯干 1"

.TorsoTemplate="HPW_ZSF_Assault_Torso_Full"
.TorsoName="Z.S.F.突击 - 躯干 1"

.TorsoTemplate="CNV_ZSF_Assault_Torso_VarA"
.TorsoName="Z.S.F.突击 - 躯干 2"

.TorsoTemplate="LPL_ZSF_Assault_Torso_VarA"
.TorsoName="Z.S.F.突击 - 躯干 2"

.TorsoTemplate="MPL_ZSF_Assault_Torso_VarA"
.TorsoName="Z.S.F.突击 - 躯干 2"

.TorsoTemplate="HPL_ZSF_Assault_Torso_VarA"
.TorsoName="Z.S.F.突击 - 躯干 2"

.TorsoTemplate="LPW_ZSF_Assault_Torso_VarA"
.TorsoName="Z.S.F.突击 - 躯干 2"

.TorsoTemplate="MPW_ZSF_Assault_Torso_VarA"
.TorsoName="Z.S.F.突击 - 躯干 2"

.TorsoTemplate="HPW_ZSF_Assault_Torso_VarA"
.TorsoName="Z.S.F.突击 - 躯干 2"

.TorsoTemplate="CNV_ZSF_Assault_Torso_VarB"
.TorsoName="Z.S.F.突击 - 躯干 3"

.TorsoTemplate="LPL_ZSF_Assault_Torso_VarB"
.TorsoName="Z.S.F.突击 - 躯干 3"

.TorsoTemplate="MPL_ZSF_Assault_Torso_VarB"
.TorsoName="Z.S.F.突击 - 躯干 3"

.TorsoTemplate="HPL_ZSF_Assault_Torso_VarB"
.TorsoName="Z.S.F.突击 - 躯干 3"

.TorsoTemplate="LPW_ZSF_Assault_Torso_VarB"
.TorsoName="Z.S.F.突击 - 躯干 3"

.TorsoTemplate="MPW_ZSF_Assault_Torso_VarB"
.TorsoName="Z.S.F.突击 - 躯干 3"

.TorsoTemplate="HPW_ZSF_Assault_Torso_VarB"
.TorsoName="Z.S.F.突击 - 躯干 3"

.TorsoTemplate="CNV_ZSF_Assault_Torso_VarC"
.TorsoName="Z.S.F.突击 - 躯干 4"

.TorsoTemplate="LPL_ZSF_Assault_Torso_VarC"
.TorsoName="Z.S.F.突击 - 躯干 4"

.TorsoTemplate="MPL_ZSF_Assault_Torso_VarC"
.TorsoName="Z.S.F.突击 - 躯干 4"

.TorsoTemplate="HPL_ZSF_Assault_Torso_VarC"
.TorsoName="Z.S.F.突击 - 躯干 4"

.TorsoTemplate="LPW_ZSF_Assault_Torso_VarC"
.TorsoName="Z.S.F.突击 - 躯干 4"

.TorsoTemplate="MPW_ZSF_Assault_Torso_VarC"
.TorsoName="Z.S.F.突击 - 躯干 4"

.TorsoTemplate="HPW_ZSF_Assault_Torso_VarC"
.TorsoName="Z.S.F.突击 - 躯干 4"

.LegsTemplate="CNV_ZSF_Assault_Legs_Full"
.LegsName="Z.S.F.突击 - 腿部 1"

.LegsTemplate="LPL_ZSF_Assault_Legs_Full"
.LegsName="Z.S.F.突击 - 腿部 1"

.LegsTemplate="MPL_ZSF_Assault_Legs_Full"
.LegsName="Z.S.F.突击 - 腿部 1"

.LegsTemplate="HPL_ZSF_Assault_Legs_Full"
.LegsName="Z.S.F.突击 - 腿部 1"

.LegsTemplate="LPW_ZSF_Assault_Legs_Full"
.LegsName="Z.S.F.突击 - 腿部 1"

.LegsTemplate="MPW_ZSF_Assault_Legs_Full"
.LegsName="Z.S.F.突击 - 腿部 1"

.LegsTemplate="HPW_ZSF_Assault_Legs_Full"
.LegsName="Z.S.F.突击 - 腿部 1"

.LegsTemplate="CNV_ZSF_Assault_Legs_VarA"
.LegsName="Z.S.F.突击 - 腿部 2"

.LegsTemplate="LPL_ZSF_Assault_Legs_VarA"
.LegsName="Z.S.F.突击 - 腿部 2"

.LegsTemplate="MPL_ZSF_Assault_Legs_VarA"
.LegsName="Z.S.F.突击 - 腿部 2"

.LegsTemplate="HPL_ZSF_Assault_Legs_VarA"
.LegsName="Z.S.F.突击 - 腿部 2"

.LegsTemplate="LPW_ZSF_Assault_Legs_VarA"
.LegsName="Z.S.F.突击 - 腿部 2"

.LegsTemplate="MPW_ZSF_Assault_Legs_VarA"
.LegsName="Z.S.F.突击 - 腿部 2"

.LegsTemplate="HPW_ZSF_Assault_Legs_VarA"
.LegsName="Z.S.F.突击 - 腿部 2"

.LegsTemplate="CNV_ZSF_Assault_Legs_VarB"
.LegsName="Z.S.F.突击 - 腿部 3"

.LegsTemplate="LPL_ZSF_Assault_Legs_VarB"
.LegsName="Z.S.F.突击 - 腿部 3"

.LegsTemplate="MPL_ZSF_Assault_Legs_VarB"
.LegsName="Z.S.F.突击 - 腿部 3"

.LegsTemplate="HPL_ZSF_Assault_Legs_VarB"
.LegsName="Z.S.F.突击 - 腿部 3"

.LegsTemplate="LPW_ZSF_Assault_Legs_VarB"
.LegsName="Z.S.F.突击 - 腿部 3"

.LegsTemplate="MPW_ZSF_Assault_Legs_VarB"
.LegsName="Z.S.F.突击 - 腿部 3"

.LegsTemplate="HPW_ZSF_Assault_Legs_VarB"
.LegsName="Z.S.F.突击 - 腿部 3"

.LegsTemplate="CNV_ZSF_Assault_Legs_VarC"
.LegsName="Z.S.F.突击 - 腿部 4"

.LegsTemplate="LPL_ZSF_Assault_Legs_VarC"
.LegsName="Z.S.F.突击 - 腿部 4"

.LegsTemplate="MPL_ZSF_Assault_Legs_VarC"
.LegsName="Z.S.F.突击 - 腿部 4"

.LegsTemplate="HPL_ZSF_Assault_Legs_VarC"
.LegsName="Z.S.F.突击 - 腿部 4"

.LegsTemplate="LPW_ZSF_Assault_Legs_VarC"
.LegsName="Z.S.F.突击 - 腿部 4"

.LegsTemplate="MPW_ZSF_Assault_Legs_VarC"
.LegsName="Z.S.F.突击 - 腿部 4"

.LegsTemplate="HPW_ZSF_Assault_Legs_VarC"
.LegsName="Z.S.F.突击 - 腿部 4"

;==============================================================================================================================
;------------------------------------------------------------------------------------------------------------------------------
;REAPER - BODY 1
;------------------------------------------------------------------------------------------------------------------------------
;==============================================================================================================================

.TorsoTemplate="CNV_BOIII_Reaper_Body1_Torso"
.TorsoName="O.E.M. - 躯干 (ST)"

.TorsoTemplate="LPL_BOIII_Reaper_Body1_Torso"
.TorsoName="O.E.M. - 躯干 (ST)"

.TorsoTemplate="MPL_BOIII_Reaper_Body1_Torso"
.TorsoName="O.E.M. - 躯干 (ST)"

.TorsoTemplate="HPL_BOIII_Reaper_Body1_Torso"
.TorsoName="O.E.M. - 躯干 (ST)"

.TorsoTemplate="LPW_BOIII_Reaper_Body1_Torso"
.TorsoName="O.E.M. - 躯干 (ST)"

.TorsoTemplate="MPW_BOIII_Reaper_Body1_Torso"
.TorsoName="O.E.M. - 躯干 (ST)"

.TorsoTemplate="HPW_BOIII_Reaper_Body1_Torso"
.TorsoName="O.E.M. - 躯干 (ST)"

.LegsTemplate="CNV_BOIII_Reaper_Body1_Legs"
.LegsName="O.E.M. - 腿部 (ST)"

.LegsTemplate="LPL_BOIII_Reaper_Body1_Legs"
.LegsName="O.E.M. - 腿部 (ST)"

.LegsTemplate="MPL_BOIII_Reaper_Body1_Legs"
.LegsName="O.E.M. - 腿部 (ST)"

.LegsTemplate="HPL_BOIII_Reaper_Body1_Legs"
.LegsName="O.E.M. - 腿部 (ST)"

.LegsTemplate="LPW_BOIII_Reaper_Body1_Legs"
.LegsName="O.E.M. - 腿部 (ST)"

.LegsTemplate="MPW_BOIII_Reaper_Body1_Legs"
.LegsName="O.E.M. - 腿部 (ST)"

.LegsTemplate="HPW_BOIII_Reaper_Body1_Legs"
.LegsName="O.E.M. - 腿部 (ST)"

.TorsoTemplate="CNV_BOIII_Reaper_Body1_Torso_NST"
.TorsoName="O.E.M. - 躯干 (默认)"

.TorsoTemplate="LPL_BOIII_Reaper_Body1_Torso_NST"
.TorsoName="O.E.M. - 躯干 (默认)"

.TorsoTemplate="MPL_BOIII_Reaper_Body1_Torso_NST"
.TorsoName="O.E.M. - 躯干 (默认)"

.TorsoTemplate="HPL_BOIII_Reaper_Body1_Torso_NST"
.TorsoName="O.E.M. - 躯干 (默认)"

.TorsoTemplate="LPW_BOIII_Reaper_Body1_Torso_NST"
.TorsoName="O.E.M. - 躯干 (默认)"

.TorsoTemplate="MPW_BOIII_Reaper_Body1_Torso_NST"
.TorsoName="O.E.M. - 躯干 (默认)"

.TorsoTemplate="HPW_BOIII_Reaper_Body1_Torso_NST"
.TorsoName="O.E.M. - 躯干 (默认)"

.LegsTemplate="CNV_BOIII_Reaper_Body1_Legs_NST"
.LegsName="O.E.M. - 腿部 (默认)"

.LegsTemplate="LPL_BOIII_Reaper_Body1_Legs_NST"
.LegsName="O.E.M. - 腿部 (默认)"

.LegsTemplate="MPL_BOIII_Reaper_Body1_Legs_NST"
.LegsName="O.E.M. - 腿部 (默认)"

.LegsTemplate="HPL_BOIII_Reaper_Body1_Legs_NST"
.LegsName="O.E.M. - 腿部 (默认)"

.LegsTemplate="LPW_BOIII_Reaper_Body1_Legs_NST"
.LegsName="O.E.M. - 腿部 (默认)"

.LegsTemplate="MPW_BOIII_Reaper_Body1_Legs_NST"
.LegsName="O.E.M. - 腿部 (默认)"

.LegsTemplate="HPW_BOIII_Reaper_Body1_Legs_NST"
.LegsName="O.E.M. - 腿部 (默认)"